---
layout: post
status: publish
published: true
title: 'CodeIgniter : URL limpias'
author:
  display_name: Ariel Orozco
  login: ariel
  email: bassplayer85@gmail.com
  url: ''
author_login: ariel
author_email: bassplayer85@gmail.com
wordpress_id: 20
wordpress_url: http://arielorozco.com/?p=20
date: '2008-12-22 22:26:00 -0600'
date_gmt: '2008-12-23 04:26:00 -0600'
categories:
- tutoriales
- programacion
- codeigniter
tags: []
comments:
- id: 26
  author: Blog de juegos turbios
  author_email: ''
  author_url: ''
  date: '2010-09-17 03:30:24 -0600'
  date_gmt: '2010-09-17 03:30:24 -0600'
  content: hola sigo todos estos pasos, pero me aparece esto cuando abro mi sitio<br
    &#47;><br &#47;>Internal Server Error<br &#47;><br &#47;>The server encountered
    an internal error or misconfiguration and was unable to complete your request.<br
    &#47;><br &#47;>Please contact the server administrator, admin@localhost and inform
    them of the time the error occurred, and anything you might have done that may
    have caused the error.<br &#47;><br &#47;>More information about this error may
    be available in the server error log.<br &#47;><br &#47;>Por que puede ser???
- id: 56
  author: Ariel Orozco
  author_email: bassplayer85@gmail.com
  author_url: ''
  date: '2012-11-18 17:49:25 -0600'
  date_gmt: '2012-11-18 23:49:25 -0600'
  content: Esto puede ser por una mala configuraci&oacute;n en tu archivo .htacess.
    Comprueba que las lineas esten escritas correctamente y que tengas habilitado
    el mod_rewrite en tu servidor web.
---
<p align="justify">Algo muy &uacute;til que permite el <a href="http:&#47;&#47;geekbass.blogspot.com&#47;2008&#47;12&#47;empezando-con-codeigniter.html">CodeIgniter<&#47;a> es utilizar "URLs limpias", lo que hace esto es quitar cualquier nombre de archivo y extinci&oacute;n al final de la URL, inclusive los par&aacute;metros enviados por GET, con lo que obtenemos URLs limpias y f&aacute;ciles de aprender.<&#47;p></p>
<p align="justify">Por ejemplo, usualmente en sitios din&aacute;micos tenemos la direcci&oacute;n: www.midominio.com&#47;paginas.php?num=54 , en CodeIgniter se ver&iacute;a algo as&iacute;: www.midominio.com&#47;index.php&#47;paginas&#47;num&#47;54. Eso limpia bastante la URL, y cumple con el patr&oacute;n de dise&ntilde;o <a href="http:&#47;&#47;www.blogger.com&#47;es.wikipedia.org&#47;wiki&#47;Modelo_Vista_Controlador">MVC<&#47;a>. Para ver como trabajan las URLs en CodeIgniter pueden consultar la <a href="http:&#47;&#47;codeigniter.com&#47;user_guide&#47;general&#47;urls.html">referencia<&#47;a> del framework.<&#47;p></p>
<p align="justify">Como pudieron ver por defecto es necesario incluir el index.php en la URL, pero esto se puede modificar f&aacute;cilmente, y despu&eacute;s de buscar cual es la mejor manera que funciona en la mayor&iacute;a de los casos, aqu&iacute; se las dejo:<&#47;p></p>
<ul>
<li>
<p align="justify">Abren el archivo <strong><span style="text-decoration: underline;">System&#47;application&#47;config&#47;config.php<&#47;span> <&#47;strong>y se fijan que esta l&iacute;nea est&eacute; as&iacute;: $config['index_page'] = "";<&#47;p><br />
<&#47;li><br />
<&#47;ul></p>
<ul>
<li>
<div align="justify">En la raiz de su sitio crean un archivo en blanco que se llame .<a href="http:&#47;&#47;httpd.apache.org&#47;docs&#47;1.3&#47;howto&#47;htaccess.html">htaccess<&#47;a>, lo abren con un editor de texto y copian esto:<&#47;div></p>
<div align="justify">
<p>[plain]<br />
RewriteEngine On<br />
RewriteBase &#47;<br />
RewriteCond %{REQUEST_URI} ^system.*<br />
RewriteRule ^(.*)$ &#47;index.php&#47;$1 [L]</p>
<p>RewriteCond %{REQUEST_FILENAME} !-f<br />
RewriteCond %{REQUEST_FILENAME} !-d<br />
RewriteRule ^(.*)$ index.php&#47;$1 [L]</p>
<p>ErrorDocument 404 &#47;index.php[&#47;plain]</p>
<p><&#47;div><&#47;li><br />
<&#47;ul></p>
<ul>
<li>
<div align="justify">Reinician su servidor web (si est&aacute;n trabajando localmente) y listo!<&#47;div><&#47;li><br />
<&#47;ul></p>
<p align="justify">Si est&aacute;n trabajando su aplicaci&oacute;n dentro de un directorio en su servidor tienen que cambiar la l&iacute;nea donde esta el index.php?&#47;$1 y anteponer el nombre del directorio (midirectorio&#47;index.php?&#47;$1). Tomen en cuenta que esto funciona para servidores que corren <a href="http:&#47;&#47;www.blogger.com&#47;www.apache.org">Apache<&#47;a> y que soportan estos archivos de configuraci&oacute;n.<&#47;p></p>
<p align="justify">Cualquier duda o consultan pueden comentarlo ;)<&#47;p></p>
