---
layout: post
status: publish
published: true
title: Laravel Design Patterns and Best Practices
author:
  display_name: Ariel Orozco
  login: ariel
  email: bassplayer85@gmail.com
  url: ''
author_login: ariel
author_email: bassplayer85@gmail.com
wordpress_id: 171
wordpress_url: http://arielorozco.com/?p=171
date: '2014-10-01 16:00:38 -0600'
date_gmt: '2014-10-01 22:00:38 -0600'
categories:
- reviews
- libros
tags:
- reviews
- libros
comments: []
---
<p><strong>Autor<&#47;strong>: Arda Kılı&ccedil;dağı, H. İbrahim YILMAZ<br />
<strong>Editorial<&#47;strong>: Packt Publishing<br />
<strong>P&aacute;ginas<&#47;strong>: 106<br />
<strong>Fecha&nbsp;de publicaci&oacute;n<&#47;strong>: Julio 2014<br />
<strong>ISBN<&#47;strong>: 9781783287987<br />
<strong>Dirigido a<&#47;strong>: Desarrolladores que trabajan con Laravel que desean aumentar la eficiencia de sus aplicaciones<br />
<strong>Nivel requerido<&#47;strong>: Intermedio<br />
<strong>Rating<&#47;strong>: 9&#47;10<br />
<strong>Pros<&#47;strong>: Ejemplos pr&aacute;cticos muy buenos para implementar patrones de dise&ntilde;o en aplicaciones con Laravel<br />
<strong>Cons<&#47;strong>: Algunos cap&iacute;tulos mencionan explicaciones que se pueden encontrar en la documentaci&oacute;n</p>
<p><a href="http:&#47;&#47;laravel.com&#47;" target="_blank">Laravel<&#47;a> se est&aacute; convirtiendo en uno de los frameworks <a href="http:&#47;&#47;php.net&#47;" target="_blank">PHP<&#47;a> mas utilizados hoy en d&iacute;a&nbsp;por miles de desarrolladores. Yo lo recomiendo totalmente para quien quiera&nbsp;desarrollar aplicaciones web de una manera elegante, sencilla y expresiva, siguiendo con principios <a href="http:&#47;&#47;es.wikipedia.org&#47;wiki&#47;SOLID_(object-oriented_design)" target="_blank">SOLID<&#47;a>.</p>
<p>El libro&nbsp;<a href="https:&#47;&#47;www.packtpub.com&#47;web-development&#47;laravel-design-patterns-and-best-practices" target="_blank">Laravel Design Patterns and Best Practices<&#47;a> aborda de una forma pr&aacute;ctica y sencilla los principios de utilizaci&oacute;n de patrones de dise&ntilde;o en aplicaciones web utilizando de base a Laravel como framework de desarrollo. Para el que no este muy familiarizado&nbsp;con los patrones de dise&ntilde;o, el autor hace una breve explicaci&oacute;n de cada uno de ellos, y menciona casos pr&aacute;cticos en los que estos se pueden utilizar en nuestras aplicaciones.</p>
<p>Se muestran ejemplos de clases ya presentes en el framework que hacen uso de alg&uacute;n patron de dise&ntilde;o, con esto&nbsp;nos permite entender de manera m&aacute;s visual a trav&eacute;s del c&oacute;digo ya implementado en el framework.</p>
<p>Laravel utiliza el patr&oacute;n de arquitectura de software <a href="http:&#47;&#47;es.wikipedia.org&#47;wiki&#47;Modelo%E2%80%93vista%E2%80%93controlador" target="_blank">MVC<&#47;a>, por lo que el autor hace una extensiva explicaci&oacute;n de como se implementa este en el framework, y como funcionan los controladores, modelos y vistas. Adem&aacute;s nos da varias recomendaciones de cuales pueden ser las mejores pr&aacute;cticas que podemos utilizar en nuestro c&oacute;digo, para ayudarnos a que nuestras aplicaciones puedan crecer adecuadamente, tener todo bajo control y hacer las cosas como deben de ser.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
